model {
  faster_rcnn {
    num_classes: 1
    image_resizer {
      fixed_shape_resizer {
        height: 512
        width: 512
      }
    }
    feature_extractor {
      type: "faster_rcnn_resnet101"
      first_stage_features_stride: 16
    }
    first_stage_anchor_generator {
      grid_anchor_generator {
        height_stride: 16
        width_stride: 16
        scales: 0.0625
        scales: 0.09375
        scales: 0.125
        scales: 0.1875
        scales: 0.25
        scales: 0.375
        scales: 0.5
        scales: 1.0
        scales: 2.0
        aspect_ratios: 1.0
      }
    }
    first_stage_box_predictor_conv_hyperparams {
      op: CONV
      regularizer {
        l2_regularizer {
          weight: 0.0
        }
      }
      initializer {
        truncated_normal_initializer {
          stddev: 0.01
        }
      }
    }
    first_stage_nms_score_threshold: 0.0
    first_stage_nms_iou_threshold: 0.7
    first_stage_max_proposals: 300
    first_stage_localization_loss_weight: 2.0
    first_stage_objectness_loss_weight: 1.0
    initial_crop_size: 14
    maxpool_kernel_size: 2
    maxpool_stride: 2
    second_stage_box_predictor {
      mask_rcnn_box_predictor {
        fc_hyperparams {
          op: FC
          regularizer {
            l2_regularizer {
              weight: 0.0
            }
          }
          initializer {
            variance_scaling_initializer {
              factor: 1.0
              uniform: true
              mode: FAN_AVG
            }
          }
        }
        use_dropout: false
        dropout_keep_probability: 1.0
      }
    }
    second_stage_post_processing {
      batch_non_max_suppression {
        score_threshold: 0.0
        iou_threshold: 0.6
        max_detections_per_class: 100
        max_total_detections: 100
      }
      score_converter: SOFTMAX
    }
    second_stage_localization_loss_weight: 2.0
    second_stage_classification_loss_weight: 1.0
  }
}
train_config {
  batch_size: 8
  data_augmentation_options {
    random_horizontal_flip {
    }
  }
  data_augmentation_options {
    random_vertical_flip {
    }
  }
  optimizer {
    adam_optimizer {
      learning_rate {
        exponential_decay_learning_rate {
          initial_learning_rate: 0.001
        }
      }
    }
  }
  gradient_clipping_by_norm: 10.0
  fine_tune_checkpoint: "/gpfs/projects/ml/astro_net/pretrained_resnet101/model.ckpt"
  from_detection_checkpoint: true
  num_steps: 1000
  batch_queue_capacity: 8
  num_batch_queue_threads: 8
  max_number_of_boxes: 25
}
eval_config {
  num_visualizations: 20
  num_examples: 50
  max_evals: 4
}
train_input_reader {
  label_map_path: "/gpfs/projects/ml/data/satdetect/astronet_label_map_2.pbtxt"
  tf_record_input_reader {
    input_path: "/gpfs/projects/ml/data/satdetect/astronet_train_3.tfrecords"
  }
}
eval_input_reader {
  label_map_path: "/gpfs/projects/ml/data/satdetect/astronet_label_map_2.pbtxt"
  shuffle: false
  num_readers: 1
  tf_record_input_reader {
    input_path: "/gpfs/projects/ml/data/satdetect/astronet_valid_3.tfrecords"
  }
}
